<?php
//СРС Част 1, Задача 1
$a=3;
$c=b;
echo b3;

//Задача 2
$a=10;
$b=2;
echo(a+b);
echo(a-b);
echo(a*b);
echo(a/b);


//Задача 3
$c=15;
$d=2;
$result = c + d;
echo(result);

//Задача 4

$a=10;
$b=2;
$c=5;
echo(a+b+c);

//Задача 5

$a=17;
$b=10;
$c = $a-$b;
$d=17;
$result = $с + $d;
echo (result);

//Часть 2 Задание 1
$text = "Привет,Мир";
echo $text + "Моя первая программа";

//Задание 2
$text = "Привет";
$text2 = "Мир!";
echo(text + text2);

//Задание 3
$name = "Valera";
echo "Привет, + name";
$text = "Новый текст";

//Задание 4
$age = 19;
$height = 172;

//Задача 5
$text = "abcde";
echo $text [0];
echo $text [2];
echo $text [4];

//Част 3 Задание 1

$arr = ['a','b','c'];
var_dump(arr);
echo $arr[0];
echo $arr[2];
echo $arr[4];

//Задание 2

echo $arr[0].$arr[2].$arr[4];

//Задание 3
$arr = ['a','b','c','d'];
echo $arr[0], '+'. $arr[1], '+'. $arr[2], '+'. $arr[3];

//Задание 4
$arr = [2,5,3,9];
$result = arr[0] * arr[1] + arr[2] * arr[3];
echo $result;

//Задание 5
$arr[] =1;
$arr[] =2;
$arr[] =3;
$arr[] =4;
$arr[] =5;

//Часть 4 Задание 1

$arr = ['a'=>11, 'b'=>20, 'c'=>30];
echo $arr["с"];

//Задание 2

$arr = ['q3'=>12, 'r3'=>23, 'f3=>32'];
echo $arr[q3] + $arr[r3] + $arr[f3];

//Задание 3
$arr = ['Коля'=>'1000$', 'Вася'=>'500$','Петя'=>'200$'];
echo $arr['Коля'];
echo $arr[Петя];

//Задание 4

$arr = ['01'=>'Январь','02'=>'Февраль','03'=>'Март','04'=>'Апрель','05'=>'Май','06'=>'Июнь','07'=>'Июль','08'=>'Август','09'=>'Сентябрь','10'=>'Октябрь','11'=>'Ноябрь','12'=>'Декабр'];
echo $arr['09'];
echo $arr['06'];








